In [1]:
import tabula
import re
import pandas as pd
import numpy as np
import math
from pdf2image import convert_from_path
from PIL import Image
import pytesseract

In [2]:
pdf_path = 'Gz_Ia1p21.pdf'

In [4]:
tables = tabula.read_pdf(pdf_path, pages='103-105', multiple_tables=True)

In [5]:
var = {}
tbl = 0
for t in tables:
    c = 3
    s = 0
    for i in range(3):
        var_df = f"t{tbl}"
        var[var_df] = t[t.columns[s:c]]
        c+=3
        s+=3
        tbl+=1

In [6]:
df0 = var['t0']
df1 = var['t1']

In [7]:
pd.concat([df0, df1])

,Roll-No Name,Unnamed: 0,Result,Roll-No Name.1,Unnamed: 1,Result.1
0,"211001 - GOVT. COLLEGE, GUJRANWALA",NaN,NaN,NaN,NaN,NaN
1,301572 KAMRAN------------------------,NaN,171,NaN,NaN,NaN
2,301577 MUHAMMAD YOUNIS---------------,NaN,208,NaN,NaN,NaN
3,301580 HAFIZ ABDULLAH BUTT-----------,NaN,365,NaN,NaN,NaN
4,301583 MUHAMMAD RAMZAN---------------,NaN,196,NaN,NaN,NaN
...,...,...,...,...,...,...
35,NaN,NaN,NaN,302108 EZAM SEYAM--------------------,NaN,191
36,NaN,NaN,NaN,302112 MUHAMMAD ZAIN UL ABEDIN-------,NaN,356
37,NaN,NaN,NaN,302115 MUHAMMAD ZAIN KHAN------------,NaN,171
38,NaN,NaN,NaN,302117 MUHAMMAD ZAIN UL ABAIDIN------,NaN,230
39,NaN,NaN,NaN,302119 UMAIR ALI BHATTI--------------,NaN,171

In [8]:
df_final = pd.concat([df0, df1], axis=0, ignore_index=True)

In [9]:
df_final

,Roll-No Name,Unnamed: 0,Result,Roll-No Name.1,Unnamed: 1,Result.1
0,"211001 - GOVT. COLLEGE, GUJRANWALA",NaN,NaN,NaN,NaN,NaN
1,301572 KAMRAN------------------------,NaN,171,NaN,NaN,NaN
2,301577 MUHAMMAD YOUNIS---------------,NaN,208,NaN,NaN,NaN
3,301580 HAFIZ ABDULLAH BUTT-----------,NaN,365,NaN,NaN,NaN
4,301583 MUHAMMAD RAMZAN---------------,NaN,196,NaN,NaN,NaN
...,...,...,...,...,...,...
75,NaN,NaN,NaN,302108 EZAM SEYAM--------------------,NaN,191
76,NaN,NaN,NaN,302112 MUHAMMAD ZAIN UL ABEDIN-------,NaN,356
77,NaN,NaN,NaN,302115 MUHAMMAD ZAIN KHAN------------,NaN,171
78,NaN,NaN,NaN,302117 MUHAMMAD ZAIN UL ABAIDIN------,NaN,230
79,NaN,NaN,NaN,302119 UMAIR ALI BHATTI--------------,NaN,171

In [10]:
df = df_final.drop('Unnamed: 0', axis= 1)

In [11]:
df['Roll'] = [re.split(' ', i)[0] for i in df['Roll-No Name']]

TypeError: expected string or bytes-like object, got 'float'

In [12]:
df

,Roll-No Name,Result,Roll-No Name.1,Unnamed: 1,Result.1
0,"211001 - GOVT. COLLEGE, GUJRANWALA",NaN,NaN,NaN,NaN
1,301572 KAMRAN------------------------,171,NaN,NaN,NaN
2,301577 MUHAMMAD YOUNIS---------------,208,NaN,NaN,NaN
3,301580 HAFIZ ABDULLAH BUTT-----------,365,NaN,NaN,NaN
4,301583 MUHAMMAD RAMZAN---------------,196,NaN,NaN,NaN
...,...,...,...,...,...
75,NaN,NaN,302108 EZAM SEYAM--------------------,NaN,191
76,NaN,NaN,302112 MUHAMMAD ZAIN UL ABEDIN-------,NaN,356
77,NaN,NaN,302115 MUHAMMAD ZAIN KHAN------------,NaN,171
78,NaN,NaN,302117 MUHAMMAD ZAIN UL ABAIDIN------,NaN,230
79,NaN,NaN,302119 UMAIR ALI BHATTI--------------,NaN,171

In [26]:
''.join(re.split(' ', df['Roll-No Name'][0])[1:])

'-GOVT.COLLEGE,GUJRANWALA'

In [38]:
df['Roll-No Name'] = [''.join(re.split(' ', i)[1:]) for i in df['Roll-No Name']]

In [62]:
type(np.nan)

float

In [77]:
type(math.nan)

float

In [79]:
type(df['Result'][1])

str

In [82]:
df['Result'][0]

nan

In [84]:
type(df['Result'][0])

float

In [149]:
df_final[df_final['Result']==217]

Empty DataFrame
Columns: [Roll-No Name, Unnamed: 0, Result]
Index: []

In [150]:
df = df_final[df_final['Result'] != np.nan]

In [151]:
roll = [re.split(' ', i)[0] for i in df['Roll-No Name']]

In [152]:
roll

['211001',
 '301572',
 '301577',
 '301580',
 '301583',
 '301586',
 '301589',
 '301617',
 '301624',
 '301657',
 '301662',
 '301666',
 '301669',
 '301672',
 '301675',
 '301677',
 '301705',
 '301712',
 '301716',
 '301719',
 '301722',
 '301725',
 '301728',
 '301731',
 '301733',
 '301760',
 '301767',
 '301772',
 '301775',
 '301778',
 '301781',
 '301784',
 '301787',
 '301790',
 '301814',
 '301821',
 '301827',
 '301831',
 '301835',
 '301839',
 '211001',
 '301572',
 '301577',
 '301580',
 '301583',
 '301586',
 '301589',
 '301617',
 '301624',
 '301657',
 '301662',
 '301666',
 '301669',
 '301672',
 '301675',
 '301677',
 '301705',
 '301712',
 '301716',
 '301719',
 '301722',
 '301725',
 '301728',
 '301731',
 '301733',
 '301760',
 '301767',
 '301772',
 '301775',
 '301778',
 '301781',
 '301784',
 '301787',
 '301790',
 '301814',
 '301821',
 '301827',
 '301831',
 '301835',
 '301839',
 '211001',
 '301572',
 '301577',
 '301580',
 '301583',
 '301586',
 '301589',
 '301617',
 '301624',
 '301657',
 '301662',
 '301666',
 '301669',
 '301672',
 '301675',
 '301677',
 '301705',
 '301712',
 '301716',
 '301719',
 '301722',
 '301725',
 '301728',
 '301731',
 '301733',
 '301760',
 '301767',
 '301772',
 '301775',
 '301778',
 '301781',
 '301784',
 '301787',
 '301790',
 '301814',
 '301821',
 '301827',
 '301831',
 '301835',
 '301839']

In [153]:
df

                              Roll-No Name  Unnamed: 0 Result
0       211001 - GOVT. COLLEGE, GUJRANWALA         NaN    NaN
1    301572 KAMRAN------------------------         NaN    171
2    301577 MUHAMMAD YOUNIS---------------         NaN    208
3    301580 HAFIZ ABDULLAH BUTT-----------         NaN    365
4    301583 MUHAMMAD RAMZAN---------------         NaN    196
..                                     ...         ...    ...
115  301821 SIRAT ALI---------------------         NaN    208
116  301827 MUHAMMAD USMAN----------------         NaN    355
117  301831 AHMAD ASLAM-------------------         NaN    285
118  301835 HANZLA------------------------         NaN    171
119  301839 MUHAMMAD SUFYAN---------------         NaN    257

[120 rows x 3 columns]

In [24]:
text_pattern = 'Unnamed'

In [32]:
df.columns

Index(['Roll-No Name', 'Unnamed: 0', 'Result', 'Roll-No Name.1', 'Unnamed: 1',
       'Result.1', 'Roll-No Name.2', 'Unnamed: 2', 'Result.2'],
      dtype='object')

In [38]:
df['Roll-No Name'][2]

'301577 MUHAMMAD YOUNIS---------------'

In [30]:
columns_to_drop = [col for col in df.columns if any(df[col].str.match(text_pattern))]

AttributeError: Can only use .str accessor with string values!

In [ ]:
df = df.drop(columns=columns_to_drop)

In [29]:
columns_to_drop

[]

In [52]:
df1

                             Roll-No Name  Unnamed: 0  Result
0      211001 - GOVT. COLLEGE, GUJRANWALA         NaN     NaN
1   301572 KAMRAN------------------------         NaN     171
2   301577 MUHAMMAD YOUNIS---------------         NaN     208
3   301580 HAFIZ ABDULLAH BUTT-----------         NaN     365
4   301583 MUHAMMAD RAMZAN---------------         NaN     196
5   301586 MUHAMMAD ARSALAN--------------         NaN     309
6   301589 RAZA ULLAH--------------------         NaN     193
7   301617 ALI HAIDER--------------------         NaN     193
8   301624 MUHAMMAD MUKARRAM RAZA--------         NaN     231
9   301657 MUHAMMAD SUFYAN ALI-----------         NaN     213
10  301662 MUHAMMAD SAMI-----------------         NaN     171
11  301666 ALI HAIDER--------------------         NaN     250
12  301669 SAFEER IFTIKHAR---------------         NaN     420
13  301672 ABUZAR------------------------         NaN     183
14  301675 ADEEL AHMAD-------------------         NaN     PHY
15  301677 ZAKRIA NASIR------------------         NaN     242
16  301705 NAVEED AHMED------------------         NaN     217
17  301712 MUHAMMAD AHMED----------------         NaN     171
18  301716 WAQAR AHMAD-------------------         NaN     217
19  301719 ZAIGHAM ABBAS KHAN------------         NaN     171
20  301722 ALI HAIDER--------------------         NaN  ABSENT
21  301725 MUHAMMAD ALI------------------         NaN     381
22  301728 MUHAMMAD PERVAIZ--------------         NaN     236
23  301731 MUHAMMAD UMAR-----------------         NaN     286
24  301733 AFTAB AHMAD-------------------         NaN     250
25  301760 SHAHID KHAN-------------------         NaN     187
26  301767 MUHAMMAD YASEEN CHATTAH-------         NaN     243
27  301772 UMER FIAZ---------------------         NaN     172
28  301775 ZAIN ALLAH DITTA--------------         NaN     290
29  301778 HAROON------------------------         NaN     171
30  301781 HUZAIFA-----------------------         NaN     198
31  301784 JAWAD AHMAD-------------------         NaN     PHY
32  301787 MUHAMMAD AHMAD----------------         NaN     183
33  301790 UMAR ZIKRIA-------------------         NaN     385
34  301814 RAB NAWAZ---------------------         NaN  ABSENT
35  301821 SIRAT ALI---------------------         NaN     208
36  301827 MUHAMMAD USMAN----------------         NaN     355
37  301831 AHMAD ASLAM-------------------         NaN     285
38  301835 HANZLA------------------------         NaN     171
39  301839 MUHAMMAD SUFYAN---------------         NaN     257

In [85]:
tables = tabula.read_pdf('Resultcard.pdf', pages='103', multiple_tables=True)

Error from tabula-java:
Exception in thread "main" java.lang.IndexOutOfBoundsException: Page number does not exist.
	at technology.tabula.ObjectExtractor.extractPage(ObjectExtractor.java:19)
	at technology.tabula.PageIterator.next(PageIterator.java:30)
	at technology.tabula.CommandLineApp.extractFile(CommandLineApp.java:161)
	at technology.tabula.CommandLineApp.extractFileTables(CommandLineApp.java:124)
	at technology.tabula.CommandLineApp.extractTables(CommandLineApp.java:106)
	at technology.tabula.CommandLineApp.main(CommandLineApp.java:76)

CalledProcessError: Command '['java', '-Djava.awt.headless=true', '-Dfile.encoding=UTF8', '-jar', '/Users/hassanazhar/anaconda3/lib/python3.11/site-packages/tabula/tabula-1.0.5-jar-with-dependencies.jar', '--pages', '103', '--guess', '--format', 'JSON', 'Resultcard.pdf']' returned non-zero exit status 1.

In [126]:
pdf_file = 'Resultcard.pdf'

In [127]:
images = convert_from_path(pdf_file, dpi=300)

In [128]:
# Save each page as an image
for i, image in enumerate(images):
    image.save('new.jpg', 'JPEG')

In [130]:
image_file = 'new.jpg'

In [131]:
image = Image.open(image_file)

In [132]:
extracted_text = pytesseract.image_to_string(image)

In [133]:
extracted_text

'Board of Intermediate & Secondary Education, Gujranwala\n\nINTERMEDIATE (PART-I) ANNUAL EXAMINATION, 2021\n\nPROVISIONAL RESULT INTIMATION\n\nGroup: PRE-MEDICAL\n\nRoll No.: 328356 Registration No.: 2-2-6028569-20\nName: MOMNA RASHEED Form No.: 2620020039\nFather\'s Name: ABDUL RASHEED Bind-Sr.No.: 300508-37\nCollege: 262002-GOVT. COLLEGE FOR WOMEN, HAJIPURA, SIALKOT\n’ Max. Marks Percentile Relative\nSr. Name of Subjects Result Status\nMarks Obtained Score Grade\n1 ISLAMIC EDUCATION 50 18 36 E PASS\n3 URDU 100 37 37 E PASS\n4 ENGLISH 100 37 37 E PASS\n5 PHYSICS 85 28 - - PASS\n6 CHEMISTRY 85 33 38.82 E PASS\n7 BIOLOGY 85 28 -- -- PASS\nTotal: 505 181\n\nNotification: 181\n\nThe candidate has passed and obtained marks: One Hundred Eighty-One Only.\n\n"The marks awarded are the best prediction of the performance and has been awarded under COVID-19 Examinations Policy.\nhence considered as valid and fair.”\n\nNote:-\ni-This result gazette is issued provisionally, errors and omissions excepted, as a notice only. Any entry appearing in this notification does not in itself\nconfer any right or privilege on a candidate for the grant of certificate which will be issued under the rules/ regulations on the basis of the original\nrecord of the Board\'s office.\n\nii-For rechecking you can apply within 20 days after result declaration date.\n\nili-In Case of any query related to result, contact to Board Official Mr.GHULAM ABBAS\n\nItis an electronically generated provisional result intimation so there is no need for signature\n\nCONTROLLER OF EXAMINATIONS\n'